app/controllers/cows_controller.rb

  def index
    @cows = Cow.all
---
SELECT "cows".* FROM "cows"

  def show
    id = params[:id]
    @cow = Cow.find(id)
---
SELECT  "cows".* FROM "cows" WHERE "cows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]